{"config": [{"config": {"output_shape": null, "name": "ld_0", "batch_input_shape": [null, 16, 64, 1], "output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000S\u0000\u0000\u0000s\u0011\u0000\u0000\u0000|\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000\u0083\u0001\u0000\u001bS)\u0001N)\u0002\u00da\u0001K\u00da\u0003std)\u0001\u00da\u0007in_data\u00a9\u0000r\u0004\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>D\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "function_type": "lambda", "dtype": "float32"}, "class_name": "Lambda"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "filters": 24, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "bias_regularizer": null, "name": "cv_1", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "filters": 36, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "name": "cv_2", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [2, 2], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"center": true, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "bn_00", "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "do_00", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "filters": 48, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "name": "cv_3", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [2, 2], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"center": true, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "bn_01", "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "do_01", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "name": "cv_4", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"center": true, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "bn_0", "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "do_0", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activity_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "name": "cv_5", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "ft_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"center": true, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "bn_0_0", "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "do_0_0", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 100, "kernel_regularizer": null, "name": "fc_1", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"center": true, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "bn_1", "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "do_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 50, "kernel_regularizer": null, "name": "fc_2", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"center": true, "epsilon": 0.001, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "name": "bn_2", "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "do_2", "rate": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 10, "kernel_regularizer": null, "name": "fc_3", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 1, "kernel_regularizer": null, "name": "out", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "linear", "trainable": true, "bias_constraint": null, "use_bias": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.5", "backend": "tensorflow"}