{"config": [{"config": {"batch_input_shape": [null, 16, 64, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "filters": 24, "trainable": true, "bias_constraint": null, "use_bias": true, "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "cv_1", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "valid", "kernel_regularizer": null, "kernel_size": [5, 5]}, "class_name": "Conv2D"}, {"config": {"filters": 36, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "cv_2", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same", "kernel_regularizer": null, "kernel_size": [5, 5]}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn_00", "axis": -1, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "do_00", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"filters": 48, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "trainable": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "cv_3", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same", "kernel_regularizer": null, "kernel_size": [5, 5]}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn_01", "axis": -1, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "do_01", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "cv_4", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn_0", "axis": -1, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "do_0", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "trainable": true, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "name": "cv_5", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_last", "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "ft_1"}, "class_name": "Flatten"}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn_0_0", "axis": -1, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "do_0_0", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"units": 100, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fc_1", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn_1", "axis": -1, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "do_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"units": 50, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fc_2", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"momentum": 0.99, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "bn_2", "axis": -1, "gamma_regularizer": null, "center": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "do_2", "rate": 0.1}, "class_name": "Dropout"}, {"config": {"units": 10, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "fc_3", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"units": 1, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "name": "out", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential"}